[
    {
      "name": "Anthony Ferrara",
      "homepage": true,
      "company": "Lingo Live",
      "title": "CTO",
      "bio": "Anthony Ferrara is the CTO for Lingo Live. He specializes in Object Oriented Design, Application Architecture, Web Application Security, and Team Building and Management. He is best known for his contributions to the PHP language, along with a broad history of collaborations to the PHP community as a whole. You can follow his blog at http://blog.ircmaxell.com or on Twitter at https://twitter.com/ircmaxell.",
      "avatar": "/img/speakers/anthony.jpg",
      "social": {
        "twitter": "https://twitter.com/ircmaxell",
        "github": "https://github.com/ircmaxell",
        "linkedin": "https://www.linkedin.com/in/ircmaxell/"
      },
      "sessions": [
        {
          "title": "Keynote: Microservices gone wrong",
          "description": "Microservices are the latest architectural trend to take the PHP community by storm. Is it a good pattern? How can you use it effectively? In this talk, we'll explore real world experience building out a large scale application based around microservices: what worked really well, what didn't work at all, and what we learned along the way. Spoiler alert: we got a lot wrong.",
          "keynote": 1,
          "track": 1,
          "session": 1,
          "time": "10:00",
          "finish": "10:40",
          "language": "English"
        }
      ]
    },
    {
      "name": "Gabi Davila",
      "homepage": true,
      "company": "Google",
      "title": "Developer Advocate",
      "bio": "Gabi is a Developer Advocate at Google Cloud and a passionate Software Engineer. She likes simplifying complex systems, and believes abstractions are best when they can be understood in a real life example. She’s driven to go beyond DBA lingo to make database and storage technology more accessible to software developers.",
      "avatar": "/img/speakers/gabi.jpg",
      "social": {
        "twitter": "http://www.twitter.com/gabidavila",
        "github": "http://github.com/gabidavila",
        "linkedin": "http://linkedin.com/in/gabidavila"
      },
      "sessions": [
        {
          "title": "MySQL 8.0: Not only Good, GREAT!",
          "description": "Sick and tired of \"X technology is only good for starting out; after you do, move to Y\"? Good news - you don’t need to move away, you just need to get in further! In this talk, you'll learn about improvements in the newest version of the most used database in the world. What are Window Functions? How do you use CTEs? How can the new default encoding help me and what should I look for when upgrading versions?",
          "keynote": 0,
          "track": 1,
          "session": 2,
          "time": "11:00",
          "finish": "11:40",
          "language": "English"
        }
      ]
    },
    {
      "name": "Derick Rethans",
      "homepage": true,
      "company": "MongoDB",
      "title": "Sr. Software Engineer at ",
      "bio": "Derick has contributed in a number of ways to the PHP project, including the Xdebug debugging tool, and various extensions and additions. He's a frequent lecturer at conferences, the author of php|architect's Guide to Date and Time Programming, and the co-author of PHP 5 Power Programming. He works as an independent contractor and consultant on PHP extensions and related projects, including Xdebug.",
      "avatar": "/img/speakers/derick.jpg",
      "social": {
        "twitter": "https://twitter.com/derickr",
        "github": "https://github.com/derickr",
        "linkedin": "https://www.linkedin.com/in/derickrethans"
      },
      "sessions": [
        {
          "title": "It's all about the goto",
          "description": "Don't worry, this is not about the goto keyword. In this presentation, I am showing you some of the inner workings of PHP. We are going to look at how different language keywords and constructs are handled internally. Basically, everything is converted to goto, but the how and why, is not as simple as it seems! We'll also have a look at what sort of optimisations opcache does to make your code run faster. This is a very in depth talk, mostly interesting to people that want to know how PHP works internally. Expect lots of wonkyness, a form of assembly, and trees.",
          "keynote": 0,
          "track": 1,
          "session": 4,
          "time": "12:40",
          "finish": "13:20",
          "language": "English"
        }
      ]
    },
    {
      "name": "Nikita Popov",
      "homepage": true,
      "company": "JetBrains",
      "title": "Software Developer",
      "bio": "Hi! My name is Nikita Popov, but you’ll mostly meet me as nikic on the internet. I’m working as a software developer at JetBrains on the PhpStorm team. Before that, I studied computer science and physics at the Technical University of Berlin. I contribute to the PHP and LLVM projects and maintain a number of open-source PHP libraries.",
      "avatar": "/img/speakers/nikita.jpg",
      "social": {
        "twitter": "https://twitter.com/nikita_ppv",
        "github": "https://github.com/nikic",
        "linkedin": "https://www.linkedin.com/in/nikita-popov-16973990"
      },
      "sessions": [
        {
          "title": "Looking Forward to PHP 8",
          "description": "While PHP 7.4 is not released yet, development has already started on the next major version: PHP 8. This talk will discuss features that have already landed, as well as backwards compatibility breaks to look out for. We'll also talk about the planned just-in-time (JIT) compiler, which promises further performance improvements.\n\nAs PHP 8 is still in early development, the final feature set is not yet known. Part of this talk will be more speculative and discuss functionality that people plan to work on, but that will not necessarily make the release. Maybe your feedback can help us focus on what is most important.",
          "keynote": 0,
          "track": 1,
          "session": 7,
          "time": "15:40",
          "finish": "16:20",
          "language": "English"
        }
      ]
    },
    {
      "name": "Ben Marks",
      "homepage": true,
      "company": "Adobe",
      "title": "Magento Evangelist",
      "bio": "Ben began his career in PHP building commercial sites in 2003, focusing on Magento since 2008 and joining the ranks of Magento as their sole evangelist in 2014. He believes that the boundless requirements of commerce provide some of the best fodder for development (and for conference discussions). Always a learner, frequently a teacher, his approach to speaking and attending conferences is to find the story, enjoyment, and (often) humor in every situation.\n",
      "avatar": "/img/speakers/ben-marks.jpg",
      "social": {
        "twitter": "https://twitter.com/benmarks",
        "github": "https://github.com/benmarks",
        "linkedin": "https://www.linkedin.com/in/bhmarks/"
      },
      "sessions": [
        {
          "title": "PWA for PHP Developers",
          "description": "Progressive Web Apps are an emerging approach to solving the problem of having the Web, everywhere: different mobile devices, IoT devices, and areas with low bandwidth or poor connectivity. For developers accustomed to PHP and server-side rendering, there are several factors to consider. Drawing on our experiences working with Google to build a PWA development experience for Magento, this talk introduces the elements of PWA, the challenges of providing online+offline functionality, and the limitations of this nascent approach.",
          "keynote": 0,
          "track": 1,
          "session": 5,
          "time": "14:00",
          "finish": "14:40",
          "language": "English"
        }
      ]
    },
    {
      "name": "Emir Karşıyakalı",
      "homepage": true,
      "company": "Moneo",
      "title": "Founder",
      "bio": "Emir Karşıyakalı is founder and software architect at moneo, an Istanbul based company that specializes in web application development. He has a decade of experience building web applications. He has been involved in software architecture and development for many years and writes code in PHP, Go, JavaScript, Swift and other interesting languages. He is an open source enthusiast and an advocate of modern development principles & standards. He loves speaking at conferences, pushing teams to do their best work and to try out new technologies. Leader of PHP User group in Istanbul, Turkey and organizer of PHPKonf. He’s given many talks and workshops at conferences like Devnot, Özgür Web Teknolojileri Günleri and Google Devfest.",
      "avatar": "/img/speakers/emir.png",
      "social": {
        "twitter": "https://twitter.com/emirkarsiyakali",
        "github": "https://github.com/emir",
        "linkedin": "https://www.linkedin.com/in/emirkarsiyakali"
      },
      "sessions": [
        {
          "title": "2020'de PHP",
          "description": "PHP 25 yıllık dinamik tipli (dynamically typed) bir yazılım dili. 2015 yılında yayınlanan 7.0 sürümüyle gelen Scalar & Return type declarations ile yarı dinamik, yarı statik (gradually typed) bir dil oldu. Aralık 2019'da yayınlanacak PHP 7.4 ile de PHP'e statik tip (statically typed) desteği ekleniyor. Oturumda PHP ile static typing'i PHP 7.4 üzerinden detaylarıyla inceleyecek, PHP 7.4 ve PHP 8.0'da hayatımıza girecek diğer özelliklere göz atacağız.",
          "keynote": 0,
          "track": 2,
          "session": 2,
          "time": "11:00",
          "finish": "11:40",
          "language": "Türkçe"
        }
      ]
    },
    {
      "name": "Ersoy Pembe",
      "homepage": false,
      "company": "Insider",
      "title": "Sr. Software Developer",
      "bio": "Ersoy Pembe has been working as a senior software engineer and architect for Insider. He holds a BSc Computer Engineering degree from Koç University. Before joining Insider, he worked for InsightHealth (Germany), Mobven, Peak Games, and Positive. He is an expert at designing, developing and maintaining scalable systems.",
      "avatar": "/img/speakers/ersoy.jpg",
      "social": {
        "twitter": "#",
        "github": "https://github.com/ersoy-insider",
        "linkedin": "https://tr.linkedin.com/in/ersoy-pembe"
      },
      "sessions": [
        {
          "title": "Doğru Teknoloji, Doğru Zaman",
          "description": "Teknolojinin hızla geliştiği, çeşitliliğin ve alternatiflerin hızla arttığı günümüzde; bu gelişmeler geliştiricilerin bir yandan işlerini kolaylaştırken bir yandan da projelerin bireysel deneylere dönüşmesi riskini  yanında getiriyor. Yeni gelişmelerin dışında kalmadan, kendimizi adapte etmeye çalışırken diğer taraftan verebileceğimiz yanlış kararlar ile projelerin kaderlerini etkileyebilir yada bizden sonraki gelecek geliştiricilerin hayatının zorlaştırabiliriz. Oturumda bu dengeyi nasıl kurmalıyız sorusunun cevabını arayacağız.",
          "keynote": 0,
          "track": 2,
          "session": 5,
          "time": "14:00",
          "finish": "14:40",
          "language": "Türkçe"
        }
      ]
    },
    {
      "name": "Taylor Lovett",
      "homepage": false,
      "company": "10up",
      "title": "VC of Engineering",
      "bio": "I am a leader, manager, and a web engineer with a passion for software, open source, and helping turn IT companies into finely tuned machines. During the day I help companies create amazing web experiences with WordPress providing high level strategy and code level expertise as the Vice President of Engineering at 10up. At night I contribute to community and personal open source Node, PHP, JavaScript, and WordPress projects. Right now I am super excited about Elasticsearch and Docker. I have spoken at web technology conferences all over the world. I have a BS in Computer Science from the University of Maryland.",
      "avatar": "/img/speakers/taylor.jpg",
      "social": {
        "twitter": "https://twitter.com/tlovett12",
        "github": "http://github.com/tlovett1",
        "linkedin": "https://www.linkedin.com/in/taylor-lovett-84520132/"
      },
      "sessions": [
        {
          "title": "WordPress Best Practices for Enterprise",
          "description": "10up open sourced their WordPress Best Practices (PHP, JavaScript, tools, and workflows). These best practices have become the industry standard for WordPress. As the VP of Engineering at 10up, I drove this project and am the lead contributor to the docs. These Best Practices allow developers to build sites that scale, perform, and are secure one sites receiving millions of page views per day. They also standardize development practices in such a way that facilitates team collaboration. This talk will highlight some important parts of the Best Practices and reveal some valuable tips about how we (10up) engineer some of the most complex and most viewed WordPress sites in the world.",
          "keynote": 0,
          "track": 1,
          "session": 3,
          "time": "11:50",
          "finish": "12:30",
          "language": "English"
        }
      ]
    },
    {
      "name": "Michael Cullum",
      "homepage": false,
      "company": "BUD",
      "title": "Senior Software/Data Engineer & Architect",
      "bio": "Michael Cullum is a backend software engineer, working particularly with PHP, and has been for about a decade. He currently works at SamKnows as a senior software engineer & architect doing data intelligence, storage and processing of internet measurement data at huge scale. He is also a manager & core developer at phpBB where he has been a contributor for over half a decade and he recently joined the Symfony Core Team as Security Lead. He is actively involved in the PHP FIG previously running the administration of it as the PHP FIG Secretary for 2 years and editor of PSR-12; he now sits on the Core Committee, the steering group of the FIG and is the editor of two security PSRs (PSR-9 and PSR-10).",
      "avatar": "/img/speakers/michaelcullum.jpg",
      "social": {
        "twitter": "https://twitter.com/michaelcullumuk",
        "github": "https://github.com/michaelcullum",
        "linkedin": "https://www.linkedin.com/in/michaelcullumukb/"
      },
      "sessions": [
        {
          "title": "Trend analysis and machine learning in PHP",
          "description": "The world we live in is one where data is one of the most valuable assets. There are many different pieces of data we can analyse on all kind of data from analytics of user behaviour of your platform, user generated content, monitoring of exception rates, or when your core business model is to provide some kind of analytics platform. This talk will talk about how you can, in your Symfony applications, perform some simple trend analysis techniques to build models, analyse data to get useful information and spot anomalies.",
          "keynote": 0,
          "track": 1,
          "session": 9,
          "time": "17:20",
          "finish": "18:00",
          "language": "English"
        }
      ]
    },
    {
      "name": "Eser Özvataf",
      "homepage": false,
      "company": "Setur",
      "title": "Lead Developer",
      "bio": "Professional experience in software delivery since 2001. Has led teams and designed architecture of solutions for clients including enterprise systems, messaging solutions, e-commerce, social media, tourism and web application projects. The recent expertise are mostly in Agile Project Management, Cloud Computing, Enterprise Architecture and DevOps. Voluntary attends conferences and local activities as a speaker, and/also a streamer on Twitch.",
      "avatar": "/img/speakers/eser.jpg",
      "social": {
        "twitter": "https://twitter.com/eser",
        "github": "https://github.com/eserozvataf",
        "linkedin": "https://www.linkedin.com/in/eserozvataf"
      },
      "sessions": [
        {
          "title": "Azure DevOps ve GitHub ile uçtan uca PHP Projeleri",
          "description": "Microsoft'un geçtiğimiz yıl içerisinde Azure DevOps ve GitHub ürünlerini belirli limitlerde ücretsizleştirmesi ile birlikte \"şirket içi açık kaynak\" anlayışı daha da uygulanabilir bir duruma geldi. Bu oturumda Azure DevOps ve GitHub'ın sağladığı repository, proje yönetimi, CI/CD ve yük testi araçları başta olmak üzere imkanlarla bir PHP projesinin yaşayabileceği uçtan uca macerayı konuşacağız.",
          "keynote": 0,
          "track": 2,
          "session": 7,
          "time": "15:40",
          "finish": "16:20",
          "language": "Türkçe"
        }
      ]
    },
    {
      "name": "Fatih Üstündağ",
      "homepage": false,
      "company": "Teknasyon Teknoloji",
      "title": "Co-founder",
      "bio": "Software architect and developer. Co-founder at Teknasyon Teknoloji. Using PHP, web technologies and Linux systems since 1999. Creates high performance solutions at Mobile area.",
      "avatar": "/img/speakers/fatih.jpg",
      "social": {
        "twitter": "https://twitter.com/fustundag",
        "github": "https://github.com/fustundag",
        "linkedin": "https://linkedin.com/in/fatihustundag"
      },
      "sessions": [
        {
          "title": "Preparing Environment for Testing and Debugging while Test",
          "description": "Writing test is a challenge but environment setup for testing is another challenge. In this session we'll find an answer about test environments with real world examples.",
          "keynote": 0,
          "track": 1,
          "session": 8,
          "time": "16:30",
          "finish": "17:10",
          "language": "English"
        }
      ]
    },
    {
      "name": "Mehmet Korkmaz",
      "homepage": false,
      "company": "Reformo",
      "title": "Technical Director",
      "bio": "Consultant and software architect @reformo and @efabrika. Neither a ninja nor a guru nor a junkie.",
      "avatar": "/img/speakers/mehmet.png",
      "social": {
        "twitter": "https://twitter.com/_mehmet_korkmaz",
        "github": "https://github.com/mkorkmaz",
        "linkedin": "https://linkedin.com/in/mehmetkorkmaz"
      },
      "sessions": [
        {
          "title": "Ports and Adapters: Altıgen Mimari",
          "description": "Modern bir yazılım projesinde son kullanıcı uygulaması, yönetim uygulaması, tekrar eden görevleri yerine getiren komut satırı uygulamaları gibi birbirinden bağımsız parçalar bulunur. Ek olarak ihtiyaç duyulan API’lar, kuyruklar ile bu yapı daha da büyür. Uygulamamızın kalbinde duran işleme mantığı bu yapıda her yere sızma eğilimindedir. Bu nedenle işleme mantığını, uygulamanın kullandığı ortamı, iletişim kurduğu network servislerini bir birinden ayırmak hayatidir. Oturumda, yukarıda bahsedilen problemin çözümüne yönelik Alistair Cockburn’ün Ports and Adapters (Hexagonal Mimari diye de bilinir) isimli yazılım mimarisi tasarısı özelinde “temiz mimarinin” detaylarından bahsedilecek.",
          "keynote": 0,
          "track": 2,
          "session": 9,
          "time": "17:20",
          "finish": "18:00",
          "language": "Turkish"
        }
      ]
    },
    {
      "name": "Uğur Erkan",
      "homepage": false,
      "company": "Rebase",
      "title": "Co-founder",
      "bio": "Juliette Reinders Folmer is an all round consultant and web-developer who tries not be a geek. Juliette is a long-standing member of PHPWomen which helped her immensely to find her feet in the PHP world. She is ZCE, actively contributes to a number of open source projects, has published several articles and speaks at conferences when given the chance. She loves it when you give her a chance to refactor spaghetti-code to something elegant and maintainable. Juliette is self-employed and based in the Netherlands.",
      "avatar": "/img/speakers/ugur.png",
      "social": {
        "twitter": "https://twitter.com/ugurerkan",
        "github": "https://github.com/ugurerkan",
        "linkedin": "https://www.linkedin.com/in/ugurerkann"
      },
      "sessions": [
        {
          "title": "API Platform: API projeleriniz için bir Framework",
          "description": "API Platform: Symfony ile geliştirilmiş açık kaynaklı bir API geliştirme projesidir. Kendi veri yapılarınız veya Schema.org üzerindeki veri yapılarını kullanarak: doğrulama, sayfalama, filtreleme, güvenlik ve daha fazlasını birkaç dakika içerisinde REST /GraphQL ile geliştirmenize ve modern veri formatları üzerinde çıktılar almanıza olanak sağlar. Ayrıca API Platform araçları ile Vue.js, React.js, React Native gibi SPA / Mobil uygulamalarına hazır kod üretebilir ve Docker, Kubernetes ile yayına gönderebilirsiniz. Oturumda API Platform kullanımı ve özellikleri anlatılacak.",
          "keynote": 0,
          "track": 2,
          "session": 3,
          "time": "11:50",
          "finish": "12:30",
          "language": "Türkçe"
        }
      ]
    },
    {
      "name": "Murat Saç",
      "homepage": false,
      "company": "Düğün.com",
      "title": "Team Lead",
      "bio": "Yaklaşık 9 yıldır başta e-ticaret, pazar yerleri ve ödeme sistemleri olmak üzere yazılım geliştirici olarak çalışmakta. Düğün.com mühendislik ekibinin bir parçası ve İstanbul takım lideri.",
      "avatar": "/img/speakers/murat.png",
      "social": {
        "twitter": "https://twitter.com/murat_sac",
        "github": "https://github.com/muratsac",
        "linkedin": "https://www.linkedin.com/in/muratsac"
      },
      "sessions": [
        {
          "title": "DDD ve Pratik Örnekler",
          "description": "Eric Evans'ın Domain Driven Design — Tackling Complexity in the Heart of Software isimli kitabında ele aldığı kavram, karmaşık iş modellerinin doğru bir şekilde anlaşılması ve uygulanması için çözümler üretmektedir. Oturumda bu çözümleri gerçek hayattan örneklerle pratik bir şekilde ele alacağız.",
          "keynote": 0,
          "track": 2,
          "session": 8,
          "time": "16:30",
          "finish": "17:10",
          "language": "Türkçe"
        }
      ]
    },
    {
      "name": "Erhan Yakut",
      "homepage": false,
      "company": "ICS Defense",
      "title": "Team Lead",
      "bio": "Software engineer with extensive experience on microservices and system architecture. Works for a hi-tech cyber security company ICS Defense. As a Software Development Team Lead, he is responsible for the development of softwares and architecture of the products developed by ICS Defense.",
      "avatar": "/img/speakers/erhan.jpg",
      "social": {
        "twitter": "https://twitter.com/yakuter",
        "github": "https://github.com/yakuter",
        "linkedin": "https://www.linkedin.com/in/erhan-yakut/"
      },
      "sessions": [
        {
          "title": "PHP ve NATS ile Mikroservis Mesajlaşma Sistemi",
          "description": "NATS Server, cloud native uygulamalarda, IoT mesajlaşma sistemlerinde ve mikroservis mimarilerinde kullanılan basit, yüksek performanslı bir açık kaynaklı mesajlaşma sistemidir. Oturumda NATS ve PHP kullanarak mikroservis mimarisinde hızlı bir mesajlaşma kanalının nasıl oluşturulacağını ele alıp gerçek bir mikroservis yapısının nasıl olması gerektiğini ve verilerin nasıl daha hızlı bir şekilde iletilebileceğini anlatacağım.",
          "keynote": 0,
          "track": 2,
          "session": 6,
          "time": "14:50",
          "finish": "15:30",
          "language": "Türkçe"
        }
      ]
    },
    {
      "name": "Pascal Borreli",
      "homepage": false,
      "company": "Les-Tilleuls.coop",
      "title": "Technical Director",
      "bio": "CEO of my life, CTO of my localhost, co-founder of my son, Symfony evangelist, impulsive typo fixer.",
      "avatar": "/img/speakers/pascal.jpg",
      "social": {
        "twitter": "https://twitter.com/pborreli",
        "github": "https://github.com/pborreli",
        "linkedin": "https://www.linkedin.com/in/pborreli/"
      },
      "sessions": [
        {
          "title": "Performance Optimization",
          "description": "I bet you are writing unit tests for your apps; if not, you probably feel ashamed. But what about performance? Everyone is talking about it but very few people actually integrate performance into their development workflow... But performance is key to success: if your website is not fast enough, you will loose both customers and revenue. Theory and good tools can go a long way to quick wins and continuous performance testing.",
          "keynote": 0,
          "track": 1,
          "session": 6,
          "time": "14:50",
          "finish": "15:30",
          "language": "English"
        }
      ]
    },
    {
      "name": "Ziyahan Albeniz",
      "homepage": false,
      "company": "Netsparker",
      "title": "Security Researcher",
      "bio": "1986 Istanbul. He graduated Computer Programming at Sakarya University. Works in Netsparker as a security researcher. He continues his work with mentorship of Ferruh Mavituna. He reported issues to alot of big company and he has been located these companies` hall of fame. His articles and researches is published on Netsparker Turkey Security Blog and he prepares and presents to his security podcast called Klavye Delikanlıları with Mustafa Yalcin.",
      "avatar": "/img/speakers/ziyahan.jpg",
      "social": {
        "twitter": "https://twitter.com/ziyaxanalbeniz",
        "github": "https://github.com/ziyahan",
        "linkedin": "https://www.linkedin.com/in/ziyahanalbeniz"
      },
      "sessions": [
        {
          "title": "OWASP Proactive Controls",
          "description": "Yazılım geliştiriciler, güvenli yazılım geliştirme ve Demokles'in Kılıcı gibi tepelerinde sallanan deadline kılıçlarıyla maalesef bu hususta yeterli performansı gösteremiyorlar. Kullanılan araçların, frameworklerin güvenlik duyarlılıkların zayıf olması ya da varsayılan olarak bu tedbirleri desteklemiyor oluşları da işin cabası. Sunumda özetle Proactive Controls maddelerini değerlendirecek ve Proactive Controls maddelerinin, OWASP Top 10 Kritik Zafiyetler Listesi'ndeki hangi derde deva olduğunu göreceğiz.",
          "keynote": 0,
          "track": 2,
          "session": 4,
          "time": "12:40",
          "finish": "13:20",
          "language": "Türkçe"
        }
      ]
    }
  ]